# -*- coding: mbcs -*-
#
# Abaqus/Viewer Release 2024 replay file
# Internal Version: 2023_09_21-20.55.25 RELr426 190762
# Run by Nie_J on Wed Jun  3 16:18:51 2026
#

# from driverUtils import executeOnCaeGraphicsStartup
# executeOnCaeGraphicsStartup()
#: Executing "onCaeGraphicsStartup()" in the site directory ...
from abaqus import *
from abaqusConstants import *
session.Viewport(name='Viewport: 1', origin=(0.0, 0.0), width=306.0791015625, 
    height=125.124992370605)
session.viewports['Viewport: 1'].makeCurrent()
session.viewports['Viewport: 1'].maximize()
from viewerModules import *
from driverUtils import executeOnCaeStartup
executeOnCaeStartup()
o2 = session.openOdb(name='Bridge-1.odb')
#: 模型: D:/STAPpp-master/STAPpp-master/abaqus/Bridge-1.odb
#: 装配件个数:         1
#: 装配件实例个数: 0
#: 部件实例的个数:     27
#: 网格数:             27
#: 单元集合数:       10
#: 结点集合数:          104
#: 分析步的个数:              1
session.viewports['Viewport: 1'].setValues(displayedObject=o2)
session.viewports['Viewport: 1'].makeCurrent()
session.viewports['Viewport: 1'].view.setValues(nearPlane=1114.43, 
    farPlane=1665.71, width=690.945, height=305.764, cameraPosition=(608.867, 
    -343.831, 1251.81), cameraUpVector=(0.086419, 0.983398, -0.159564), 
    cameraTarget=(25.7175, -21.1649, 45.4474))
session.viewports['Viewport: 1'].view.setValues(nearPlane=1246.89, 
    farPlane=1552.92, width=773.069, height=342.107, cameraPosition=(148.732, 
    -1201.18, 754.042), cameraUpVector=(0.37327, 0.757618, 0.535429), 
    cameraTarget=(21.7944, -28.4746, 41.2035))
session.viewports['Viewport: 1'].view.setValues(nearPlane=1054.81, 
    farPlane=1710.25, width=653.983, height=289.407, cameraPosition=(-947.507, 
    -787.495, 677.75), cameraUpVector=(0.555165, 0.477108, 0.681293), 
    cameraTarget=(4.81242, -22.0661, 40.0216))
session.viewports['Viewport: 1'].view.setValues(nearPlane=1007.79, 
    farPlane=1743.59, width=624.833, height=276.508, cameraPosition=(-1317.04, 
    -256.44, 354.506), cameraUpVector=(0.530639, 0.101944, 0.841445), 
    cameraTarget=(3.65977, -20.4096, 39.0133))
session.viewports['Viewport: 1'].odbDisplay.display.setValues(plotState=(
    CONTOURS_ON_DEF, ))
session.viewports['Viewport: 1'].odbDisplay.display.setValues(plotState=(
    UNDEFORMED, ))
session.viewports['Viewport: 1'].odbDisplay.display.setValues(plotState=(
    CONTOURS_ON_DEF, ))
session.viewports['Viewport: 1'].odbDisplay.display.setValues(plotState=(
    UNDEFORMED, ))
session.viewports['Viewport: 1'].odbDisplay.display.setValues(plotState=(
    CONTOURS_ON_DEF, ))
session.viewports['Viewport: 1'].odbDisplay.display.setValues(plotState=(
    UNDEFORMED, ))
session.viewports['Viewport: 1'].odbDisplay.display.setValues(plotState=(
    CONTOURS_ON_DEF, ))
session.viewports['Viewport: 1'].odbDisplay.display.setValues(plotState=(
    UNDEFORMED, ))
session.viewports['Viewport: 1'].odbDisplay.display.setValues(plotState=(
    CONTOURS_ON_DEF, ))
session.viewports['Viewport: 1'].view.setValues(nearPlane=1021.48, 
    farPlane=1714.18, width=633.323, height=280.265, cameraPosition=(-1282.32, 
    463.846, -63.4602), cameraUpVector=(0.275321, -0.0132493, 0.961261), 
    cameraTarget=(3.62271, -21.1787, 39.4596))
session.viewports['Viewport: 1'].odbDisplay.display.setValues(plotState=(
    UNDEFORMED, ))
session.viewports['Viewport: 1'].view.setValues(nearPlane=1006.96, 
    farPlane=1720.27, width=624.319, height=276.28, cameraPosition=(-1135.9, 
    239.102, 765.859), cameraUpVector=(0.769553, -0.148125, 0.621167), 
    cameraTarget=(2.54752, -19.5284, 33.3699))
session.viewports['Viewport: 1'].view.setValues(nearPlane=1054.24, 
    farPlane=1667.32, width=653.631, height=289.252, cameraPosition=(-793.389, 
    70.4994, 1153.5), cameraUpVector=(0.958203, -0.0847222, 0.273258), 
    cameraTarget=(-1.12153, -17.7223, 29.2173))
session.viewports['Viewport: 1'].view.setValues(nearPlane=1191.49, 
    farPlane=1515.65, width=738.726, height=326.909, cameraPosition=(26.2622, 
    11.9278, 1403.41), cameraUpVector=(0.92718, -0.114669, -0.356634), 
    cameraTarget=(-11.6282, -16.9715, 26.0139))
session.viewports['Viewport: 1'].view.setValues(nearPlane=1193.58, 
    farPlane=1514.47, width=740.024, height=327.483, cameraPosition=(-10.9329, 
    -0.574055, 1404.13), cameraUpVector=(0.937477, -0.103989, -0.33215), 
    cameraTarget=(-10.9509, -16.7439, 26.0009))
session.viewports['Viewport: 1'].view.setValues(nearPlane=1144.74, 
    farPlane=1563.32, width=1407.56, height=622.888, viewOffsetX=6.42536, 
    viewOffsetY=30.0186)
session.viewports['Viewport: 1'].view.setValues(nearPlane=1045.95, 
    farPlane=1613.46, width=1286.1, height=569.137, cameraPosition=(-382.516, 
    859.897, 989.392), cameraUpVector=(0.807541, -0.502852, 0.308248), 
    cameraTarget=(8.03059, -27.1675, 9.54996), viewOffsetX=5.87089, 
    viewOffsetY=27.4282)
session.viewports['Viewport: 1'].view.setValues(nearPlane=1091.25, 
    farPlane=1545.29, width=1341.8, height=593.786, cameraPosition=(-335.123, 
    1242.38, 337.096), cameraUpVector=(0.312067, -0.469872, 0.825733), 
    cameraTarget=(27.7091, -49.1959, 21.3826), viewOffsetX=6.12514, 
    viewOffsetY=28.616)
session.viewports['Viewport: 1'].view.setValues(nearPlane=1164.33, 
    farPlane=1470.5, width=1431.66, height=633.553, cameraPosition=(-60.4424, 
    1315.2, 102.995), cameraUpVector=(0.0344462, -0.380185, 0.924269), 
    cameraTarget=(23.7639, -58.6004, 31.8127), viewOffsetX=6.53534, 
    viewOffsetY=30.5324)
session.viewports['Viewport: 1'].view.setValues(nearPlane=1157.37, 
    farPlane=1477.45, width=1423.11, height=629.768, viewOffsetX=112.738, 
    viewOffsetY=20.5238)
session.viewports['Viewport: 1'].view.setValues(nearPlane=1135.67, 
    farPlane=1466.83, width=1396.43, height=617.962, cameraPosition=(126.222, 
    1293.21, -24.1859), cameraUpVector=(-0.0660962, -0.28093, 0.95745), 
    cameraTarget=(16.2571, -78.8443, 45.465), viewOffsetX=110.624, 
    viewOffsetY=20.139)
session.viewports['Viewport: 1'].view.setValues(nearPlane=1111.43, 
    farPlane=1511.45, width=1366.63, height=604.774, cameraPosition=(50.8357, 
    1003.69, 892.977), cameraUpVector=(-0.260843, -0.830194, 0.492685), 
    cameraTarget=(21.8304, -60.2218, 17.3449), viewOffsetX=108.263, 
    viewOffsetY=19.7092)
session.viewports['Viewport: 1'].view.setValues(nearPlane=1099.64, 
    farPlane=1528.66, width=1352.13, height=598.359, cameraPosition=(5.6877, 
    21.2981, 1365.19), cameraUpVector=(-0.554461, -0.77988, -0.29045), 
    cameraTarget=(11.1367, -59.2448, -10.6653), viewOffsetX=107.114, 
    viewOffsetY=19.5001)
session.viewports['Viewport: 1'].view.setValues(nearPlane=1133.46, 
    farPlane=1494.85, width=903.791, height=399.955, viewOffsetX=80.9021, 
    viewOffsetY=-16.3419)
session.viewports['Viewport: 1'].view.setValues(nearPlane=1136.3, 
    farPlane=1492.54, width=906.056, height=400.957, cameraPosition=(-1.11571, 
    20.0402, 1365.48), cameraUpVector=(-0.552347, -0.78002, -0.294079), 
    cameraTarget=(11.5012, -59.1356, -10.4027), viewOffsetX=81.1048, 
    viewOffsetY=-16.3829)
session.viewports['Viewport: 1'].view.setValues(nearPlane=1121.98, 
    farPlane=1506.85, width=1145.87, height=507.082, viewOffsetX=86.2293, 
    viewOffsetY=11.6239)
session.viewports['Viewport: 1'].view.setValues(nearPlane=841.446, 
    farPlane=1649.03, width=859.363, height=380.294, cameraPosition=(1105.11, 
    127.872, 613.932), cameraUpVector=(-0.499827, -0.752218, 0.42935), 
    cameraTarget=(-85.1951, -71.7521, -51.4972), viewOffsetX=64.6691, 
    viewOffsetY=8.71754)
session.viewports['Viewport: 1'].view.setValues(nearPlane=857.265, 
    farPlane=1621.22, width=875.519, height=387.444, cameraPosition=(1158.52, 
    287.309, 390.659), cameraUpVector=(-0.331983, -0.749695, 0.57249), 
    cameraTarget=(-98.0841, -90.7416, -30.6376), viewOffsetX=65.8849, 
    viewOffsetY=8.88143)
session.viewports['Viewport: 1'].view.setValues(nearPlane=929.396, 
    farPlane=1562.47, width=949.187, height=420.044, cameraPosition=(838.518, 
    798.258, 515.242), cameraUpVector=(0.110816, -0.891319, 0.439625), 
    cameraTarget=(-37.6133, -104.078, -48.3626), viewOffsetX=71.4285, 
    viewOffsetY=9.62873)
session.viewports['Viewport: 1'].view.setValues(nearPlane=1113.96, 
    farPlane=1390.15, width=1137.69, height=503.46, cameraPosition=(-9.01831, 
    1213.1, 366.569), cameraUpVector=(0.674848, -0.4865, 0.554886), 
    cameraTarget=(49.3874, -104.894, -32.1), viewOffsetX=85.6134, 
    viewOffsetY=11.5409)
session.viewports['Viewport: 1'].view.setValues(nearPlane=1105.22, 
    farPlane=1396.58, width=1128.76, height=499.51, cameraPosition=(105.182, 
    1195.94, 410.188), cameraUpVector=(0.0813126, -0.587305, 0.805271), 
    cameraTarget=(76.5587, -125.515, 19.8028), viewOffsetX=84.9414, 
    viewOffsetY=11.4503)
session.viewports['Viewport: 1'].view.setValues(nearPlane=1066.23, 
    farPlane=1428.22, width=1088.94, height=481.887, cameraPosition=(274.28, 
    1184.14, 341.37), cameraUpVector=(-0.0337793, -0.538345, 0.842047), 
    cameraTarget=(59.5852, -141.371, 30.9001), viewOffsetX=81.9445, 
    viewOffsetY=11.0463)
session.viewports['Viewport: 1'].view.setValues(nearPlane=1051.26, 
    farPlane=1494.78, width=1073.65, height=475.124, cameraPosition=(193.01, 
    95.9544, 1307.77), cameraUpVector=(-0.674344, -0.717185, -0.175802), 
    cameraTarget=(50.4936, -77.2747, -52.0597), viewOffsetX=80.794, 
    viewOffsetY=10.8912)
session.viewports['Viewport: 1'].view.setValues(nearPlane=1030.25, 
    farPlane=1515.79, width=1277.2, height=565.199, viewOffsetX=94.0759, 
    viewOffsetY=10.4174)
session.viewports['Viewport: 1'].view.setValues(nearPlane=926.999, 
    farPlane=1594.72, width=1149.2, height=508.556, cameraPosition=(772.683, 
    804.637, 644.058), cameraUpVector=(-0.447836, -0.592035, 0.670028), 
    cameraTarget=(3.93027, -132.373, -12.0565), viewOffsetX=84.6478, 
    viewOffsetY=9.37337)
session.viewports['Viewport: 1'].view.setValues(nearPlane=830.472, 
    farPlane=1654.29, width=1029.54, height=455.601, cameraPosition=(1173.95, 
    16.98, 467.55), cameraUpVector=(-0.618397, -0.216775, 0.755377), 
    cameraTarget=(-112.083, -106.193, -12.4458), viewOffsetX=75.8336, 
    viewOffsetY=8.39734)
session.viewports['Viewport: 1'].view.setValues(nearPlane=866.272, 
    farPlane=1627.02, width=1073.92, height=475.243, cameraPosition=(968.7, 
    -68.8516, 837.687), cameraUpVector=(-0.849661, -0.155086, 0.504008), 
    cameraTarget=(-89.7881, -98.8146, -44.444), viewOffsetX=79.1026, 
    viewOffsetY=8.75933)
session.viewports['Viewport: 1'].view.setValues(nearPlane=837.365, 
    farPlane=1645.4, width=1038.09, height=459.384, cameraPosition=(1175.31, 
    -81.0612, 452.87), cameraUpVector=(-0.624497, -0.266393, 0.734192), 
    cameraTarget=(-117.335, -92.3757, -25.0259), viewOffsetX=76.463, 
    viewOffsetY=8.46703)
session.viewports['Viewport: 1'].view.setValues(nearPlane=885.027, 
    farPlane=1597.73, width=461.389, height=204.178, viewOffsetX=88.0951, 
    viewOffsetY=-11.7837)
session.viewports['Viewport: 1'].view.setValues(nearPlane=899.559, 
    farPlane=1583.49, width=468.965, height=207.531, cameraPosition=(1041.53, 
    31.3187, 731.833), cameraUpVector=(-0.760374, -0.321089, 0.564564), 
    cameraTarget=(-85.8126, -103.453, -49.4343), viewOffsetX=89.5416, 
    viewOffsetY=-11.9772)
#: 
#: 结点: PART-PIER-1.711
#:                                         1             2             3        大小
#: 基本坐标:                 -1.28333e+01,  1.50000e+01, -3.50000e+01,      -      
#: 当前图中无变形后的坐标系.
#: 
#: 结点: PART-PIER-1.262
#:                                         1             2             3        大小
#: 基本坐标:                  1.82500e+01,  2.00000e+01, -1.50000e+01,      -      
#: 当前图中无变形后的坐标系.
session.viewports['Viewport: 1'].view.setValues(nearPlane=920.751, 
    farPlane=1558.09, width=480.013, height=212.42, cameraPosition=(878.874, 
    28.3028, 928.636), cameraUpVector=(-0.866978, -0.291087, 0.404496), 
    cameraTarget=(-69.2268, -103.88, -62.8663), viewOffsetX=91.651, 
    viewOffsetY=-12.2594)
session.viewports['Viewport: 1'].view.setValues(nearPlane=910.16, 
    farPlane=1568.68, width=634.061, height=280.591, viewOffsetX=98.127, 
    viewOffsetY=-14.4961)
session.viewports['Viewport: 1'].view.setValues(nearPlane=1053.29, 
    farPlane=1412.12, width=733.769, height=324.715, cameraPosition=(-96.1585, 
    10.7391, 1282.37), cameraUpVector=(-0.887065, -0.238067, -0.395525), 
    cameraTarget=(26.4385, -102.945, -85.6575), viewOffsetX=113.558, 
    viewOffsetY=-16.7756)
#: 
#: 结点: PART-PIER-1.11
#:                                         1             2             3        大小
#: 基本坐标:                  1.00000e+01,  2.00000e+01,  1.50000e+02,      -      
#: 当前图中无变形后的坐标系.
session.viewports['Viewport: 1'].view.setValues(nearPlane=997.323, 
    farPlane=1468.09, width=1243.33, height=550.21, viewOffsetX=142.97, 
    viewOffsetY=16.6544)
session.viewports['Viewport: 1'].view.setValues(nearPlane=1002.57, 
    farPlane=1462.85, width=1249.86, height=553.103, viewOffsetX=110.789, 
    viewOffsetY=-130.752)
#: 
#: 结点: PART-RIVERBANK-2.7
#:                                         1             2             3        大小
#: 基本坐标:                  3.00000e+02,  1.00000e+01,  0.00000e+00,      -      
#: 当前图中无变形后的坐标系.
session.viewports['Viewport: 1'].view.setValues(nearPlane=1002.1, 
    farPlane=1463.32, width=1329.01, height=588.13, viewOffsetX=114.874, 
    viewOffsetY=-158.35)
session.viewports['Viewport: 1'].view.setValues(nearPlane=996.785, 
    farPlane=1468.63, width=1321.97, height=585.012, viewOffsetX=212.956, 
    viewOffsetY=79.8131)
#: 
#: 结点: PART-RIVERBANK-1.4
#:                                         1             2             3        大小
#: 基本坐标:                 -3.00000e+02,  1.00000e+01,  0.00000e+00,      -      
#: 当前图中无变形后的坐标系.
session.viewports['Viewport: 1'].view.setValues(nearPlane=1023.09, 
    farPlane=1442.32, width=1059.37, height=468.802, viewOffsetX=190.988, 
    viewOffsetY=94.203)
session.viewports['Viewport: 1'].view.setValues(nearPlane=1021.04, 
    farPlane=1417.52, width=1057.24, height=467.86, cameraPosition=(-33.372, 
    -58.098, 1271.04), cameraUpVector=(-0.907949, -0.211113, -0.362022), 
    cameraTarget=(18.6909, -97.3655, -105.622), viewOffsetX=190.604, 
    viewOffsetY=94.0137)
session.viewports['Viewport: 1'].view.setValues(nearPlane=941.624, 
    farPlane=1514.36, width=975.008, height=431.471, cameraPosition=(635.352, 
    936.551, 542.251), cameraUpVector=(-0.446132, -0.598298, 0.665587), 
    cameraTarget=(6.92968, -97.1925, -117.985), viewOffsetX=175.779, 
    viewOffsetY=86.7014)
session.viewports['Viewport: 1'].view.setValues(nearPlane=751.945, 
    farPlane=1495.9, width=778.605, height=344.556, cameraPosition=(902.666, 
    117.383, 718.3), cameraUpVector=(-0.80277, -0.33451, 0.493624), 
    cameraTarget=(-124.208, -107.06, -173.108), viewOffsetX=140.37, 
    viewOffsetY=69.2365)
#: 
#: 结点: PART-PIER-1.11
#:                                         1             2             3        大小
#: 基本坐标:                  1.00000e+01,  2.00000e+01,  1.50000e+02,      -      
#: 当前图中无变形后的坐标系.
session.viewports['Viewport: 1'].view.setValues(nearPlane=810.889, 
    farPlane=1436.96, width=247.738, height=109.632, viewOffsetX=99.6808, 
    viewOffsetY=71.6485)
session.viewports['Viewport: 1'].view.setValues(nearPlane=872.941, 
    farPlane=1354.64, width=266.696, height=118.021, cameraPosition=(549.558, 
    -639.103, 786.542), cameraUpVector=(-0.983408, 0.0266655, 0.179435), 
    cameraTarget=(-81.8564, 62.1872, -217.928), viewOffsetX=107.309, 
    viewOffsetY=77.1314)
session.viewports['Viewport: 1'].view.setValues(nearPlane=888.907, 
    farPlane=1336.77, width=271.574, height=120.18, cameraPosition=(483.857, 
    -714.262, 761.685), cameraUpVector=(-0.988825, 0.0616504, 0.135736), 
    cameraTarget=(-65.117, 86.3308, -216.646), viewOffsetX=109.272, 
    viewOffsetY=78.5421)
#: 
#: 结点: PART-PIER-1.5
#:                                         1             2             3        大小
#: 基本坐标:                  0.00000e+00,  1.00000e+01,  1.50000e+02,      -      
#: 当前图中无变形后的坐标系.
session.viewports['Viewport: 1'].view.setValues(nearPlane=979.741, 
    farPlane=1315.53, width=299.326, height=132.461, cameraPosition=(286.01, 
    -66.2984, 1166.19), cameraUpVector=(-0.902475, -0.382196, -0.198658), 
    cameraTarget=(71.543, -54.2742, -195.175), viewOffsetX=120.438, 
    viewOffsetY=86.568)
#: 
#: 结点: PART-PIER-1.232
#:                                         1             2             3        大小
#: 基本坐标:                  1.07500e+01,  2.00000e+01,  1.35000e+02,      -      
#: 当前图中无变形后的坐标系.
session.viewports['Viewport: 1'].view.setValues(nearPlane=947.694, 
    farPlane=1347.58, width=699.848, height=309.704, viewOffsetX=135.032, 
    viewOffsetY=113.484)
session.viewports['Viewport: 1'].view.setValues(nearPlane=1004.92, 
    farPlane=1208.23, width=742.107, height=328.405, cameraPosition=(-107.772, 
    -1123.76, -59.439), cameraUpVector=(-0.386744, 0.359934, 0.849045), 
    cameraTarget=(-193.736, 249.42, -139.646), viewOffsetX=143.186, 
    viewOffsetY=120.336)
session.viewports['Viewport: 1'].view.setValues(nearPlane=975.083, 
    farPlane=1277.9, width=720.073, height=318.654, cameraPosition=(-350.266, 
    -1095.32, 137.383), cameraUpVector=(-0.320597, 0.584861, 0.745088), 
    cameraTarget=(-129.762, 225.635, -188.054), viewOffsetX=138.935, 
    viewOffsetY=116.763)
session.viewports['Viewport: 1'].view.setValues(nearPlane=763.686, 
    farPlane=1405.33, width=563.962, height=249.57, cameraPosition=(769.77, 
    -23.1125, 826.929), cameraUpVector=(-0.698971, -0.710423, 0.0820936), 
    cameraTarget=(-63.7574, 23.5997, -269.659), viewOffsetX=108.814, 
    viewOffsetY=91.4489)
session.viewports['Viewport: 1'].view.setValues(nearPlane=958.193, 
    farPlane=1289.07, width=707.6, height=313.135, cameraPosition=(87.4739, 
    43.035, 1180.7), cameraUpVector=(-0.5221, -0.77448, -0.3572), 
    cameraTarget=(171.919, 27.3421, -194.829), viewOffsetX=136.528, 
    viewOffsetY=114.74)
session.viewports['Viewport: 1'].view.setValues(nearPlane=746.464, 
    farPlane=1427.71, width=551.245, height=243.943, cameraPosition=(864.773, 
    273.698, 677.687), cameraUpVector=(-0.336136, -0.938235, 0.0820212), 
    cameraTarget=(-103.307, 47.4365, -276.819), viewOffsetX=106.36, 
    viewOffsetY=89.3862)
session.viewports['Viewport: 1'].view.setValues(nearPlane=762.148, 
    farPlane=1411.32, width=562.828, height=249.068, cameraPosition=(855.059, 
    183.917, 720.766), cameraUpVector=(-0.440692, -0.894752, 0.0721777), 
    cameraTarget=(-82.376, 51.3958, -280.787), viewOffsetX=108.595, 
    viewOffsetY=91.2643)
session.viewports['Viewport: 1'].view.setValues(nearPlane=848.427, 
    farPlane=1343.93, width=626.543, height=277.264, cameraPosition=(548.646, 
    123.84, 1008.78), cameraUpVector=(-0.468854, -0.872775, -0.135794), 
    cameraTarget=(54.9194, 62.674, -276.497), viewOffsetX=120.888, 
    viewOffsetY=101.596)
session.viewports['Viewport: 1'].view.setValues(nearPlane=936.24, 
    farPlane=1228.12, width=691.391, height=305.962, cameraPosition=(241.393, 
    -834.438, 723.453), cameraUpVector=(-0.224949, -0.233419, -0.945999), 
    cameraTarget=(130.549, 320.268, -20.7332), viewOffsetX=133.4, 
    viewOffsetY=112.111)
session.viewports['Viewport: 1'].view.setValues(nearPlane=919.128, 
    farPlane=1228.44, width=678.755, height=300.37, cameraPosition=(-58.0121, 
    -1080.78, -81.9612), cameraUpVector=(-0.0854241, 0.559029, -0.824736), 
    cameraTarget=(202.752, 236.774, 227.073), viewOffsetX=130.962, 
    viewOffsetY=110.062)
session.viewports['Viewport: 1'].view.setValues(nearPlane=935.176, 
    farPlane=1204.14, width=690.607, height=305.614, cameraPosition=(38.0077, 
    -1061.57, -179.755), cameraUpVector=(-0.00544596, 0.630669, -0.776033), 
    cameraTarget=(160.815, 232.271, 278.876), viewOffsetX=133.249, 
    viewOffsetY=111.984)
session.viewports['Viewport: 1'].view.setValues(nearPlane=951.724, 
    farPlane=1193.03, width=702.827, height=311.023, cameraPosition=(28.56, 
    -1088.69, 9.58966), cameraUpVector=(0.0479907, 0.487077, -0.872039), 
    cameraTarget=(154.378, 263.433, 244.926), viewOffsetX=135.607, 
    viewOffsetY=113.966)
session.viewports['Viewport: 1'].view.setValues(nearPlane=889.2, 
    farPlane=1293.64, width=656.656, height=290.59, cameraPosition=(-31.4556, 
    49.2305, 1155.38), cameraUpVector=(0.0485172, -0.916574, -0.39691), 
    cameraTarget=(173.421, 147.503, -203.965), viewOffsetX=126.698, 
    viewOffsetY=106.479)
session.viewports['Viewport: 1'].view.setValues(nearPlane=899.233, 
    farPlane=1282.5, width=664.065, height=293.869, cameraPosition=(-1.55243, 
    8.19907, 1156.32), cameraUpVector=(0.0339085, -0.901421, -0.431614), 
    cameraTarget=(167.293, 156.006, -203.497), viewOffsetX=128.128, 
    viewOffsetY=107.68)
#: 
#: 结点: PART-FLOOR-1.99
#:                                         1             2             3        大小
#: 基本坐标:                  0.00000e+00,  0.00000e+00,  0.00000e+00,      -      
#: 当前图中无变形后的坐标系.
session.viewports['Viewport: 1'].view.setValues(nearPlane=904.025, 
    farPlane=1277.71, width=635.281, height=281.131, viewOffsetX=114.328, 
    viewOffsetY=113.405)
session.viewports['Viewport: 1'].view.setValues(nearPlane=902.718, 
    farPlane=1279.23, width=634.362, height=280.725, cameraPosition=(1.49992, 
    -7.93639, 1156.42), cameraUpVector=(0.0476706, -0.894318, -0.444886), 
    cameraTarget=(163.772, 162.549, -201.539), viewOffsetX=114.162, 
    viewOffsetY=113.24)
#: 
#: 结点: PART-FLOOR-1.497
#:                                         1             2             3        大小
#: 基本坐标:                  2.35000e+02,  5.00000e+00,  0.00000e+00,      -      
#: 当前图中无变形后的坐标系.
labels = session.viewports['Viewport: 1'].getActiveNodeLabels(useCut=True, 
    printResults=True)
#: 激活的结点标签: 4163, 总共: 4163
#:    部件实例 PART-CABLE50-1: 2 (总共 2 个)
#:       1, 2
#:    部件实例 PART-CABLE50-2: 2 (总共 2 个)
#:       1, 2
#:    部件实例 PART-CABLE50-3: 2 (总共 2 个)
#:       1, 2
#:    部件实例 PART-CABLE50-4: 2 (总共 2 个)
#:       1, 2
#:    部件实例 PART-CABLE100-1: 2 (总共 2 个)
#:       1, 2
#:    部件实例 PART-CABLE100-2: 2 (总共 2 个)
#:       1, 2
#:    部件实例 PART-CABLE100-3: 2 (总共 2 个)
#:       1, 2
#:    部件实例 PART-CABLE100-4: 2 (总共 2 个)
#:       1, 2
#:    部件实例 PART-CABLE150-1: 2 (总共 2 个)
#:       1, 2
#:    部件实例 PART-CABLE150-2: 2 (总共 2 个)
#:       1, 2
#:    部件实例 PART-CABLE150-3: 2 (总共 2 个)
#:       1, 2
#:    部件实例 PART-CABLE150-4: 2 (总共 2 个)
#:       1, 2
#:    部件实例 PART-CABLE200-1: 2 (总共 2 个)
#:       1, 2
#:    部件实例 PART-CABLE200-2: 2 (总共 2 个)
#:       1, 2
#:    部件实例 PART-CABLE200-3: 2 (总共 2 个)
#:       1, 2
#:    部件实例 PART-CABLE200-4: 2 (总共 2 个)
#:       1, 2
#:    部件实例 PART-CABLE250-1: 2 (总共 2 个)
#:       1, 2
#:    部件实例 PART-CABLE250-2: 2 (总共 2 个)
#:       1, 2
#:    部件实例 PART-CABLE250-3: 2 (总共 2 个)
#:       1, 2
#:    部件实例 PART-CABLE250-4: 2 (总共 2 个)
#:       1, 2
#:    部件实例 PART-FLOOR-1: 505 (总共 505 个)
#:       1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 
#:       29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 
#:       54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 
#:       79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 
#:       104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 
#:       124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 
#:       144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 
#:       164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 
#:       184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 
#:       204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 
#:       224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 
#:       244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 
#:       264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 
#:       284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302, 303, 
#:       304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 
#:       324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338, 339, 340, 341, 342, 343, 
#:       344, 345, 346, 347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 
#:       364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 383, 
#:       384, 385, 386, 387, 388, 389, 390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 401, 402, 403, 
#:       404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419, 420, 421, 422, 423, 
#:       424, 425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441, 442, 443, 
#:       444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454, 455, 456, 457, 458, 459, 460, 461, 462, 463, 
#:       464, 465, 466, 467, 468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480, 481, 482, 483, 
#:       484, 485, 486, 487, 488, 489, 490, 491, 492, 493, 494, 495, 496, 497, 498, 499, 500, 501, 502, 503, 
#:       504, 505
#:    部件实例 PART-PIER-1: 861 (总共 861 个)
#:       1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 
#:       29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 
#:       54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 
#:       79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 
#:       104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 
#:       124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 
#:       144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 
#:       164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 
#:       184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 
#:       204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 
#:       224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 
#:       244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 
#:       264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 
#:       284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302, 303, 
#:       304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 
#:       324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338, 339, 340, 341, 342, 343, 
#:       344, 345, 346, 347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 
#:       364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 383, 
#:       384, 385, 386, 387, 388, 389, 390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 401, 402, 403, 
#:       404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419, 420, 421, 422, 423, 
#:       424, 425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441, 442, 443, 
#:       444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454, 455, 456, 457, 458, 459, 460, 461, 462, 463, 
#:       464, 465, 466, 467, 468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480, 481, 482, 483, 
#:       484, 485, 486, 487, 488, 489, 490, 491, 492, 493, 494, 495, 496, 497, 498, 499, 500, 501, 502, 503, 
#:       504, 505, 506, 507, 508, 509, 510, 511, 512, 513, 514, 515, 516, 517, 518, 519, 520, 521, 522, 523, 
#:       524, 525, 526, 527, 528, 529, 530, 531, 532, 533, 534, 535, 536, 537, 538, 539, 540, 541, 542, 543, 
#:       544, 545, 546, 547, 548, 549, 550, 551, 552, 553, 554, 555, 556, 557, 558, 559, 560, 561, 562, 563, 
#:       564, 565, 566, 567, 568, 569, 570, 571, 572, 573, 574, 575, 576, 577, 578, 579, 580, 581, 582, 583, 
#:       584, 585, 586, 587, 588, 589, 590, 591, 592, 593, 594, 595, 596, 597, 598, 599, 600, 601, 602, 603, 
#:       604, 605, 606, 607, 608, 609, 610, 611, 612, 613, 614, 615, 616, 617, 618, 619, 620, 621, 622, 623, 
#:       624, 625, 626, 627, 628, 629, 630, 631, 632, 633, 634, 635, 636, 637, 638, 639, 640, 641, 642, 643, 
#:       644, 645, 646, 647, 648, 649, 650, 651, 652, 653, 654, 655, 656, 657, 658, 659, 660, 661, 662, 663, 
#:       664, 665, 666, 667, 668, 669, 670, 671, 672, 673, 674, 675, 676, 677, 678, 679, 680, 681, 682, 683, 
#:       684, 685, 686, 687, 688, 689, 690, 691, 692, 693, 694, 695, 696, 697, 698, 699, 700, 701, 702, 703, 
#:       704, 705, 706, 707, 708, 709, 710, 711, 712, 713, 714, 715, 716, 717, 718, 719, 720, 721, 722, 723, 
#:       724, 725, 726, 727, 728, 729, 730, 731, 732, 733, 734, 735, 736, 737, 738, 739, 740, 741, 742, 743, 
#:       744, 745, 746, 747, 748, 749, 750, 751, 752, 753, 754, 755, 756, 757, 758, 759, 760, 761, 762, 763, 
#:       764, 765, 766, 767, 768, 769, 770, 771, 772, 773, 774, 775, 776, 777, 778, 779, 780, 781, 782, 783, 
#:       784, 785, 786, 787, 788, 789, 790, 791, 792, 793, 794, 795, 796, 797, 798, 799, 800, 801, 802, 803, 
#:       804, 805, 806, 807, 808, 809, 810, 811, 812, 813, 814, 815, 816, 817, 818, 819, 820, 821, 822, 823, 
#:       824, 825, 826, 827, 828, 829, 830, 831, 832, 833, 834, 835, 836, 837, 838, 839, 840, 841, 842, 843, 
#:       844, 845, 846, 847, 848, 849, 850, 851, 852, 853, 854, 855, 856, 857, 858, 859, 860, 861
#:    部件实例 PART-PIER-2: 861 (总共 861 个)
#:       1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 
#:       29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 
#:       54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 
#:       79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 
#:       104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 
#:       124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 
#:       144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 
#:       164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 
#:       184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 
#:       204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 
#:       224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 
#:       244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 
#:       264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 
#:       284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302, 303, 
#:       304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 
#:       324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338, 339, 340, 341, 342, 343, 
#:       344, 345, 346, 347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 
#:       364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 383, 
#:       384, 385, 386, 387, 388, 389, 390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 401, 402, 403, 
#:       404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419, 420, 421, 422, 423, 
#:       424, 425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441, 442, 443, 
#:       444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454, 455, 456, 457, 458, 459, 460, 461, 462, 463, 
#:       464, 465, 466, 467, 468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480, 481, 482, 483, 
#:       484, 485, 486, 487, 488, 489, 490, 491, 492, 493, 494, 495, 496, 497, 498, 499, 500, 501, 502, 503, 
#:       504, 505, 506, 507, 508, 509, 510, 511, 512, 513, 514, 515, 516, 517, 518, 519, 520, 521, 522, 523, 
#:       524, 525, 526, 527, 528, 529, 530, 531, 532, 533, 534, 535, 536, 537, 538, 539, 540, 541, 542, 543, 
#:       544, 545, 546, 547, 548, 549, 550, 551, 552, 553, 554, 555, 556, 557, 558, 559, 560, 561, 562, 563, 
#:       564, 565, 566, 567, 568, 569, 570, 571, 572, 573, 574, 575, 576, 577, 578, 579, 580, 581, 582, 583, 
#:       584, 585, 586, 587, 588, 589, 590, 591, 592, 593, 594, 595, 596, 597, 598, 599, 600, 601, 602, 603, 
#:       604, 605, 606, 607, 608, 609, 610, 611, 612, 613, 614, 615, 616, 617, 618, 619, 620, 621, 622, 623, 
#:       624, 625, 626, 627, 628, 629, 630, 631, 632, 633, 634, 635, 636, 637, 638, 639, 640, 641, 642, 643, 
#:       644, 645, 646, 647, 648, 649, 650, 651, 652, 653, 654, 655, 656, 657, 658, 659, 660, 661, 662, 663, 
#:       664, 665, 666, 667, 668, 669, 670, 671, 672, 673, 674, 675, 676, 677, 678, 679, 680, 681, 682, 683, 
#:       684, 685, 686, 687, 688, 689, 690, 691, 692, 693, 694, 695, 696, 697, 698, 699, 700, 701, 702, 703, 
#:       704, 705, 706, 707, 708, 709, 710, 711, 712, 713, 714, 715, 716, 717, 718, 719, 720, 721, 722, 723, 
#:       724, 725, 726, 727, 728, 729, 730, 731, 732, 733, 734, 735, 736, 737, 738, 739, 740, 741, 742, 743, 
#:       744, 745, 746, 747, 748, 749, 750, 751, 752, 753, 754, 755, 756, 757, 758, 759, 760, 761, 762, 763, 
#:       764, 765, 766, 767, 768, 769, 770, 771, 772, 773, 774, 775, 776, 777, 778, 779, 780, 781, 782, 783, 
#:       784, 785, 786, 787, 788, 789, 790, 791, 792, 793, 794, 795, 796, 797, 798, 799, 800, 801, 802, 803, 
#:       804, 805, 806, 807, 808, 809, 810, 811, 812, 813, 814, 815, 816, 817, 818, 819, 820, 821, 822, 823, 
#:       824, 825, 826, 827, 828, 829, 830, 831, 832, 833, 834, 835, 836, 837, 838, 839, 840, 841, 842, 843, 
#:       844, 845, 846, 847, 848, 849, 850, 851, 852, 853, 854, 855, 856, 857, 858, 859, 860, 861
#:    部件实例 PART-RIVERBANK-1: 605 (总共 605 个)
#:       1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 
#:       29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 
#:       54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 
#:       79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 
#:       104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 
#:       124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 
#:       144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 
#:       164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 
#:       184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 
#:       204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 
#:       224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 
#:       244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 
#:       264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 
#:       284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302, 303, 
#:       304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 
#:       324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338, 339, 340, 341, 342, 343, 
#:       344, 345, 346, 347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 
#:       364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 383, 
#:       384, 385, 386, 387, 388, 389, 390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 401, 402, 403, 
#:       404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419, 420, 421, 422, 423, 
#:       424, 425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441, 442, 443, 
#:       444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454, 455, 456, 457, 458, 459, 460, 461, 462, 463, 
#:       464, 465, 466, 467, 468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480, 481, 482, 483, 
#:       484, 485, 486, 487, 488, 489, 490, 491, 492, 493, 494, 495, 496, 497, 498, 499, 500, 501, 502, 503, 
#:       504, 505, 506, 507, 508, 509, 510, 511, 512, 513, 514, 515, 516, 517, 518, 519, 520, 521, 522, 523, 
#:       524, 525, 526, 527, 528, 529, 530, 531, 532, 533, 534, 535, 536, 537, 538, 539, 540, 541, 542, 543, 
#:       544, 545, 546, 547, 548, 549, 550, 551, 552, 553, 554, 555, 556, 557, 558, 559, 560, 561, 562, 563, 
#:       564, 565, 566, 567, 568, 569, 570, 571, 572, 573, 574, 575, 576, 577, 578, 579, 580, 581, 582, 583, 
#:       584, 585, 586, 587, 588, 589, 590, 591, 592, 593, 594, 595, 596, 597, 598, 599, 600, 601, 602, 603, 
#:       604, 605
#:    部件实例 PART-RIVERBANK-2: 605 (总共 605 个)
#:       1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 
#:       29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 
#:       54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 
#:       79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 
#:       104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 
#:       124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 
#:       144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 
#:       164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 
#:       184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 
#:       204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 
#:       224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 
#:       244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 
#:       264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 
#:       284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302, 303, 
#:       304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 
#:       324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338, 339, 340, 341, 342, 343, 
#:       344, 345, 346, 347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 
#:       364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 383, 
#:       384, 385, 386, 387, 388, 389, 390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 401, 402, 403, 
#:       404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419, 420, 421, 422, 423, 
#:       424, 425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441, 442, 443, 
#:       444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454, 455, 456, 457, 458, 459, 460, 461, 462, 463, 
#:       464, 465, 466, 467, 468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480, 481, 482, 483, 
#:       484, 485, 486, 487, 488, 489, 490, 491, 492, 493, 494, 495, 496, 497, 498, 499, 500, 501, 502, 503, 
#:       504, 505, 506, 507, 508, 509, 510, 511, 512, 513, 514, 515, 516, 517, 518, 519, 520, 521, 522, 523, 
#:       524, 525, 526, 527, 528, 529, 530, 531, 532, 533, 534, 535, 536, 537, 538, 539, 540, 541, 542, 543, 
#:       544, 545, 546, 547, 548, 549, 550, 551, 552, 553, 554, 555, 556, 557, 558, 559, 560, 561, 562, 563, 
#:       564, 565, 566, 567, 568, 569, 570, 571, 572, 573, 574, 575, 576, 577, 578, 579, 580, 581, 582, 583, 
#:       584, 585, 586, 587, 588, 589, 590, 591, 592, 593, 594, 595, 596, 597, 598, 599, 600, 601, 602, 603, 
#:       604, 605
#:    部件实例 PART-SUPPORTBEAM-1: 343 (总共 343 个)
#:       1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 
#:       29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 
#:       54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 
#:       79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 
#:       104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 
#:       124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 
#:       144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 
#:       164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 
#:       184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 
#:       204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 
#:       224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 
#:       244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 
#:       264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 
#:       284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302, 303, 
#:       304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 
#:       324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338, 339, 340, 341, 342, 343
#:    部件实例 PART-SUPPORTBEAM-2: 343 (总共 343 个)
#:       1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 
#:       29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 
#:       54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 
#:       79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 
#:       104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 
#:       124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 
#:       144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 
#:       164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 
#:       184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 
#:       204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 
#:       224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 
#:       244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 
#:       264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 
#:       284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302, 303, 
#:       304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 
#:       324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338, 339, 340, 341, 342, 343
#: 选中的查询值已写入文件 "D:/STAPpp-master/STAPpp-master/abaqus/abaqus.rpt".
session.viewports['Viewport: 1'].view.setValues(nearPlane=905.755, 
    farPlane=1276.19, width=562.409, height=248.883, viewOffsetX=78.6754, 
    viewOffsetY=99.3497)
execfile('D:/STAPpp-master/STAPpp-master/abaqus/1.py', __main__.__dict__)
#: 所有节点坐标已成功导出至: node_coordinates.csv
execfile('D:/STAPpp-master/STAPpp-master/abaqus/1.py', __main__.__dict__)
#: 所有实体的节点坐标已成功分类导出至: all_instances_nodes.csv
session.viewports['Viewport: 1'].odbDisplay.display.setValues(plotState=(
    CONTOURS_ON_DEF, ))
session.viewports['Viewport: 1'].view.setValues(nearPlane=868.147, 
    farPlane=1368.61, width=539.057, height=238.549, cameraPosition=(497.157, 
    704.801, 777.346), cameraUpVector=(0.143756, -0.972707, 0.182143), 
    cameraTarget=(-19.0952, -38.4387, -262.139), viewOffsetX=75.4087, 
    viewOffsetY=95.2246)
session.viewports['Viewport: 1'].view.setValues(nearPlane=867.907, 
    farPlane=1371.92, width=538.908, height=238.483, cameraPosition=(564.204, 
    771.323, 655.054), cameraUpVector=(-0.0235169, -0.921473, 0.387731), 
    cameraTarget=(-7.69614, -94.3554, -252.13), viewOffsetX=75.3879, 
    viewOffsetY=95.1983)
#: 
#: 结点: PART-PIER-2.347
#:                                         1             2             3        大小
#: 基本坐标:                 -3.50000e+00, -1.00000e+01,  1.40000e+02,      -      
#: 缩放:                             1.07651e+02,  1.07651e+02,  1.07651e+02,      -      
#: 变形后的坐标 (未缩放):  -3.49964e+00, -9.79238e+00,  1.39972e+02,      -      
#: 变形后的坐标 (已缩放):    -3.46084e+00,  1.23506e+01,  1.36941e+02,      -      
#: 位移 (未缩放):           3.63759e-04,  2.07621e-01, -2.84143e-02,  2.09557e-01
session.viewports['Viewport: 1'].odbDisplay.display.setValues(plotState=(
    UNDEFORMED, ))
session.viewports['Viewport: 1'].view.setValues(nearPlane=941.975, 
    farPlane=1267.77, width=584.899, height=258.836, cameraPosition=(180.506, 
    629.219, 956.885), cameraUpVector=(0.137605, -0.982699, 0.12397), 
    cameraTarget=(84.4244, -5.5759, -262.646), viewOffsetX=81.8215, 
    viewOffsetY=103.323)
o1 = session.openOdb(name='D:/下载/课程设计测试文件/Bridge-2.odb', 
    readOnly=False)
session.viewports['Viewport: 1'].setValues(displayedObject=o1)
#: 模型: D:/下载/课程设计测试文件/Bridge-2.odb
#: 装配件个数:         1
#: 装配件实例个数: 0
#: 部件实例的个数:     27
#: 网格数:             27
#: 单元集合数:       10
#: 结点集合数:          104
#: 分析步的个数:              1
session.viewports['Viewport: 1'].odbDisplay.display.setValues(plotState=(
    CONTOURS_ON_DEF, ))
session.viewports['Viewport: 1'].view.setValues(nearPlane=1194.57, 
    farPlane=1612.01, width=740.628, height=327.751, cameraPosition=(353.238, 
    -1057.78, 897.057), cameraUpVector=(-0.0682631, 0.851622, 0.519692), 
    cameraTarget=(24.7229, -25.0576, 45.5661))
session.viewports['Viewport: 1'].view.setValues(nearPlane=1050.77, 
    farPlane=1726.06, width=651.474, height=288.297, cameraPosition=(-1128.21, 
    -765.447, 308.176), cameraUpVector=(0.268094, 0.510411, 0.817072), 
    cameraTarget=(-1.74304, -19.8351, 35.0458))
session.viewports['Viewport: 1'].view.setValues(nearPlane=1112.51, 
    farPlane=1661.26, width=689.751, height=305.236, cameraPosition=(-651.29, 
    -883.629, 892.774), cameraUpVector=(0.283902, 0.815814, 0.503833), 
    cameraTarget=(1.7603, -20.7033, 39.3401))
session.viewports['Viewport: 1'].view.setValues(nearPlane=1081.19, 
    farPlane=1685.34, width=670.331, height=296.642, cameraPosition=(-742.84, 
    -668.051, 1001.83), cameraUpVector=(0.376383, 0.843772, 0.382601), 
    cameraTarget=(1.18769, -19.3549, 40.0222))
session.viewports['Viewport: 1'].odbDisplay.display.setValues(plotState=(
    UNDEFORMED, ))
session.viewports['Viewport: 1'].view.setValues(nearPlane=1175.96, 
    farPlane=1582.8, width=729.09, height=322.645, cameraPosition=(-244.839, 
    -711.122, 1206.52), cameraUpVector=(0.349661, 0.910649, 0.220127), 
    cameraTarget=(1.73115, -19.4019, 40.2456))
session.viewports['Viewport: 1'].view.setValues(nearPlane=1171.51, 
    farPlane=1587.26, width=726.332, height=321.424, viewOffsetX=45.5666, 
    viewOffsetY=9.11842)
session.viewports['Viewport: 1'].view.setValues(nearPlane=1123.54, 
    farPlane=1627.13, width=696.589, height=308.262, cameraPosition=(-622.524, 
    -1105.79, 580.529), cameraUpVector=(0.379879, 0.563009, 0.73397), 
    cameraTarget=(6.3058, -6.17149, 37.4939), viewOffsetX=43.7007, 
    viewOffsetY=8.74503)
session.viewports['Viewport: 1'].view.setValues(nearPlane=1269.05, 
    farPlane=1547.35, width=786.805, height=348.185, cameraPosition=(116.926, 
    -1307.89, 559.722), cameraUpVector=(-0.121144, 0.660088, 0.741355), 
    cameraTarget=(1.16422, -40.1208, 31.6838), viewOffsetX=49.3604, 
    viewOffsetY=9.8776)
session.viewports['Viewport: 1'].view.setValues(nearPlane=1236.72, 
    farPlane=1598.54, width=766.761, height=339.315, cameraPosition=(326.167, 
    -1326.24, 430.536), cameraUpVector=(0.0437659, 0.608839, 0.792085), 
    cameraTarget=(4.6636, -43.5126, 42.3155), viewOffsetX=48.103, 
    viewOffsetY=9.62597)
session.viewports['Viewport: 1'].view.setValues(nearPlane=1324.6, 
    farPlane=1498.44, width=821.244, height=363.425, cameraPosition=(13.2902, 
    -1411.48, 21.6581), cameraUpVector=(0.0118769, 0.334079, 0.94247), 
    cameraTarget=(-4.76538, -33.3911, 20.833), viewOffsetX=51.521, 
    viewOffsetY=10.3099)
session.viewports['Viewport: 1'].view.setValues(nearPlane=1076.7, 
    farPlane=1674.3, width=667.546, height=295.409, cameraPosition=(-879.661, 
    1051.7, 194.393), cameraUpVector=(0.684566, 0.0346233, 0.728129), 
    cameraTarget=(52.3475, 55.8973, -3.57316), viewOffsetX=41.8787, 
    viewOffsetY=8.38037)
session.viewports['Viewport: 1'].view.setValues(nearPlane=1307.55, 
    farPlane=1500.88, width=810.672, height=358.747, cameraPosition=(46.5716, 
    1387.33, -177.82), cameraUpVector=(0.0643639, -0.192283, 0.979226), 
    cameraTarget=(78.9702, 23.9993, 21.487), viewOffsetX=50.8577, 
    viewOffsetY=10.1772)
